#include <stdio.h>

int main() { 
    int i = 1, j = 2, k;
    printf(" 1: i = %d, j = %d, k = k(ยังไม่ได้กำหนดค่า)\n", i, j);// เริ่มต้น: i = 1, j = 2, k ยังไม่กำหนดค่า

    k = i + j;
    printf(" 2: i = %d, j = %d, k = %d\n", i, j, k);// เริ่มต้น: i = 1, j = 2, k = 3

    i = i + (k * j);
    printf(" 3: i = %d, j = %d, k = %d\n", i, j, k);// i = 1 + (3 * 2) = 1 + 6 = 7

    j = i / 2;
    printf(" 4: i = %d, j = %d, k = %d\n", i, j, k);// i = 7, j = 3, k = 3

    k = i % 2;
    printf(" 5: i = %d, j = %d, k = %d\n", i, j, k);// k = 7 % 2 = 1

    i = (j + k) * 3;
    printf(" 6: i = %d, j = %d, k = %d\n", i, j, k);// i = (3 + 1) * 3 = 12
   
    printf("ตาราง2 %d\n");// i = 12, j = 3, k = 1

    // การคำนวณต่อไปนี้จะใช้ตัวแปร x, y, z
    double x = 1.0, y = 2.0, z;//
    // เริ่มต้น: x = 1.0, y = 2.0 ส่วน z ยังไม่กำหนดค่า
    printf(" 1: x = %.1f, y = %.1f, z = z(ยังไม่ได้กำหนดค่า)\n", x, y);

    // บรรทัด 2: x = y + 5.0 → 2.0 + 5.0 = 7.0
    x = y + 5.0;
    printf(" 2: x = %.1f, y = %.1f, z = z(ยังไม่ได้กำหนดค่า)\n", x, y);

    // บรรทัด 3: y = x / 2.0 → 7.0 / 2.0 = 3.5
    y = x / 2.0;
    printf(" 3: x = %.1f, y = %.1f, z = z(ยังไม่ได้กำหนดค่า)\n", x, y);

    // บรรทัด 4: y = (x * 3.0) + 4.0 → (7.0*3) + 4 = 21 + 4 = 25
    y = (x * 3.0) + 4.0;
    printf(" 4: x = %.1f, y = %.1f, z = z(ยังไม่ได้กำหนดค่า)\n", x, y);

    // บรรทัด 5: x = -0.5 - y → -0.5 - 25 = -25.5
    x = -0.5 - y;
    printf(" 5: x = %.1f, y = %.1f, z = z(ยังไม่ได้กำหนดค่า)\n", x, y);

    // บรรทัด 6: z = x + y → -25.5 + 25.0 = -0.5
    z = x + y;
    printf(" 6: x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    return 0;
}