#include <stdio.h>// Include the standard input-output header

int main() {// กำหนดตัวแปรเริ่มต้น
    int a = 5,b = 2;// กำหนดตัวแปร a และ b เป็นจำนวนเต็ม
    float x = 3.0,y = 4.5;// กำหนดตัวแปร x และ y เป็นจำนวนทศนิยม

    printf("int r1 = %d\n",a++ * b+(int)y % 3);// ผลลัพธ์ของการคูณ a กับ b และการหาผลเศษของ y
    printf("int r2 = %d\n",(a>b) && ((int)x / b < 2));// ผลลัพธ์ของการเปรียบเทียบ a กับ b และการหาร x ด้วย b
    printf("float int r3 = %.2f\n",++x * y - a / 2);// ผลลัพธ์ของการเพิ่มค่า x และการคูณกับ y ลบด้วย a หาร 2
    printf("float int r4 = %.2f\n",((x += 1.5)>y) || (b-->0));// ผลลัพธ์ของการเพิ่มค่า x และการเปรียบเทียบกับ y หรือ b ลดลง
    
    return 0;// คืนค่าศูนย์เพื่อบ่งชี้ว่าการทำงานสำเร็จ
}