#include <stdio.h>

int main() {
    int A, B, C, D, E, F, G;// ประกาศตัวแปรสำหรับเก็บผลลัพธ์

    // ---------------- A ----------------
    printf("A = -2 + 5 * 2;\n");// เริ่มต้นนิพจน์ A
    printf("=> 5 * 2 = 10\n");// คำนวณ 5 * 2
    printf("=> -2 + 10 = 8\n");// คำนวณ -2 + 10
    A = -2 + 5 * 2;// คำนวณนิพจน์ A
    printf("ผลลัพธ์ของ A คือ: %d\n\n", A);// แสดงผลลัพธ์ของ A

    // ---------------- B ----------------
    printf("B = 10 / 2 * 3;\n");// เริ่มต้นนิพจน์ B
    printf("=> 10 / 2 = 5\n");// คำนวณ 10 / 2
    printf("=> 5 * 3 = 15\n");// คำนวณ 5 * 3
    B = 10 / 2 * 3;// คำนวณนิพจน์ B
    printf("ผลลัพธ์ของ B คือ: %d\n\n", B);// แสดงผลลัพธ์ของ B

    // ---------------- C ----------------
    printf("C = 6 / 2 + 3 * (4 %% 2);\n");// เริ่มต้นนิพจน์ C
    printf("=> 4 %% 2 = 0\n");// คำนวณ 4 % 2
    printf("=> 3 * 0 = 0\n");// คำนวณ 3 * 0
    printf("=> 6 / 2 = 3\n");// คำนวณ 6 / 2
    printf("=> 3 + 0 = 3\n");// คำนวณ 3 + 0
    C = 6 / 2 + 3 * (4 % 2);// คำนวณนิพจน์ C
    printf("ผลลัพธ์ของ C คือ: %d\n\n", C);// แสดงผลลัพธ์ของ C

    // ---------------- D ----------------
    printf("D = (5 + 2) * 15 %% 4;\n");// เริ่มต้นนิพจน์ D
    printf("=> 5 + 2 = 7\n");// คำนวณ 5 + 2
    printf("=> 7 * 15 = 105\n");// คำนวณ 7 * 15
    printf("=> 105 %% 4 = 1\n");// คำนวณ 105 % 4
    D = (5 + 2) * 15 % 4;// คำนวณนิพจน์ D
    printf("ผลลัพธ์ของ D คือ: %d\n\n", D);// แสดงผลลัพธ์ของ D

    // ---------------- E ----------------
    printf("E = 6 + 2 * 2 - 6 / 2;\n");// เริ่มต้นนิพจน์ E
    printf("=> 2 * 2 = 4\n");// คำนวณ 2 * 2
    printf("=> 6 / 2 = 3\n");// คำนวณ 6 / 2
    printf("=> 6 + 4 - 3 = 7\n");// คำนวณ 6 + 4 - 3
    E = 6 + 2 * 2 - 6 / 2;// คำนวณนิพจน์ E
    printf("ผลลัพธ์ของ E คือ: %d\n\n", E);// แสดงผลลัพธ์ของ E

    // ---------------- F ----------------
    printf("F = 5 + 3 * 2 - 8 / 4 + (6 %% 5);\n");// เริ่มต้นนิพจน์ F
    printf("=> 3 * 2 = 6\n");// คำนวณ 3 * 2
    printf("=> 8 / 4 = 2\n");// คำนวณ 8 / 4
    printf("=> 6 %% 5 = 1\n");// คำนวณ 6 % 5
    printf("=> 5 + 6 - 2 + 1 = 10\n");// คำนวณ 5 + 6 - 2 + 1
    F = 5 + 3 * 2 - 8 / 4 + (6 % 5);// คำนวณนิพจน์ F
    printf("ผลลัพธ์ของ F คือ: %d\n\n", F);// แสดงผลลัพธ์ของ F

    // ---------------- G ----------------
    printf("G = (4 + 3) * 2 - 10 / (2 + 3);\n");// เริ่มต้นนิพจน์ G
    printf("=> 4 + 3 = 7\n");// คำนวณ 4 + 3
    printf("=> 2 + 3 = 5\n");// คำนวณ 2 + 3
    printf("=> 7 * 2 = 14\n");// คำนวณ 7 * 2
    printf("=> 10 / 5 = 2\n");// คำนวณ 10 / 5
    printf("=> 14 - 2 = 12\n");// คำนวณ 14 - 2
    G = (4 + 3) * 2 - 10 / (2 + 3);// คำนวณนิพจน์ G
    printf("ผลลัพธ์ของ G คือ: %d\n\n", G);// แสดงผลลัพธ์ของ G

    return 0;
}